{
  "main": {
    "image": "DSRC.jpg",
    "club_points": {
      "line1": "Comprehensive Property Search & Due Diligence: ",
      "line2": "Negotiation & Contract Review: ",
      "line3": "Pre-Settlement Support & Professional Referrals: "
    },
    "club_desc": {
      "line1": "We begin with strategic sessions to plan the client’s investment portfolio, followed by an extensive search for investment properties that align with their specific selection criteria. Once potential properties are identified, we conduct thorough inspections and comprehensive due diligence to ensure each property meets our client's needs and investment goals. Additionally, we provide a detailed market analysis to assess the property's value and potential return on investment.",
      "line2": "Our team expertly negotiates the purchase price and terms with the vendor or their representative, advocating for the best possible outcome for our clients. We also conduct a meticulous review of the purchase contract to identify any potential issues and ensure that the terms are favorable. This careful attention to detail helps protect our clients' interests throughout the buying process.",
      "line3": "We offer dedicated pre-settlement support to guide clients through the final steps of the property acquisition process, addressing any questions or concerns that may arise. Furthermore, we connect clients with trusted third-party professionals, such as conveyancers, property managers, quantity surveyors, and building and pest inspectors, to facilitate a smooth and efficient investment property purchase. This comprehensive support ensures our clients feel confident and informed every step of the way."
    },
    "contactmessage": "Thinking about buying a investment property",
    "email": "Ryandaiproperty@gmail.com",
    "address": "Queensland, Australia",
    "youtube": "@RyanDaiAU",
    "wechat": "/",
    "wechat_pic": "wechat.jpg",
    "social": [
      {
        "name": "youtube",
        "url": "https://www.youtube.com/@RyanDaiAU",
        "className": "fa fa-youtube-square"
      },
      {
        "name": "facebook",
        "url": "https://www.facebook.com/share/sN8L8qosqC94wtQp/?mibextid=LQQJ4d",
        "className": "fa fa-facebook"
      }
    ]
  }
}
